// 娇柔农夫 2020年5月5日 https://github.com/AJLoveChina/birthday
var config = {
         texts: [
         "送给",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "被大傻子忘了生日的宝贝",  // 同上...
        "祝我的小可爱生日快乐",
        "也不知道这是我们认识之后",
        "你的第几个生日了",
        "发卡 台灯 八音盒 ",
        "好像并不足以表达我的心意",
        "想了想 还是送你一个特殊的礼物吧",
        "应该没有人送过同样的礼物给你吧", 
                   "你就像一个典型的白羊座女生",
                   "一副女汉子的样子",
                   "把所有人拒之门外",
                   "但是我知道的哦",
                   "你也有小女生的一面",
                   "你也有脆弱的时候",
                   "又有谁不希望被温柔相待呢",
                   "就算是我也一样",
                   "只是 我不懂温柔",
                   "可能是我没有感觉过温柔吧",
                   "在你难过的时候",
                   "我也只能傻乎乎的陪着你",
                   "说着些和安慰不沾边的话",
                   "偶尔还犯二",
                   "但是对你 我大概不止是只有朋友的感情",
                   "又说多了",
                   "还是祝我的小可爱生日快乐喽",
                   "希望以后每一个生日我都在你身边",
                   "希望你伤心难过的时候会想起我还陪着你",
                   "希望你平常开开心心",
        "以后大哥学做好吃的",
        "把你喂胖胖",
        "然后看看哪个有劲的把你抱走",
        "YAMI~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "点开看看吧",
        play: "来点音乐",
        bannar_coming: "加点背景呢",
        balloons_flying: "忘加气球了呢",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
